# ArcRunWidthTooLongFailure Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..ArcRunWidthTooLongFailure Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Arc run width is too long.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ArcRunWidthTooLongFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ArcRunWidthTooLongFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ArcRunWidthTooLongFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace